Revit 2026 API

# AssemblyMemberDifferentParameters Class

---

The two assembly members being compared have different parameters

SystemObject Autodesk.Revit.DBAssemblyMemberDifference Autodesk.Revit.DBAssemblyMemberDifferentParameters

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyMemberDifferentParameters : AssemblyMemberDifference
```
```vb
Public Class AssemblyMemberDifferentParameters
	Inherits AssemblyMemberDifference
```
```cpp
public ref class AssemblyMemberDifferentParameters : public AssemblyMemberDifference
```
```fsharp
type AssemblyMemberDifferentParameters =
    class
        inherit AssemblyMemberDifference
    end
```

The AssemblyMemberDifferentParameters type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyMemberDifference) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from AssemblyMemberDifference) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace